ilg-archived/qemu/hw/cortexm/stm32-rcc.c
/*
 * STM32 MCU - RCC (Reset and Clock Control).
 *
 * Copyright (c) 2015 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "hw/cortexm/stm32-rcc.h"
#include "hw/cortexm/cortexm-helper.h"

#include "qemu/timer.h"

/**
 * This file implements the STM32 RCC (Reset and Clock Control).
 *
 * The initial implementation is intended only to pass CMSIS initialisations.
 * This means all writes store the correct values and all reads return the
 * written values.
 * Status bits (like PLL ready) are set during the writes, so all application
 * loops waiting for those events will complete immediately.
 * Clock trees and the bits to enable peripheral clocks are not yet used by
 * the peripherals.
 *
 * References:
 * - ST CD00171190.pdf, Doc ID 13902 Rev 15, "RM0008 Reference Manual,
 * STM32F101xx, STM32F102xx, STM32F103xx, STM32F105xx and STM32F107xx
 * advanced ARM®-based 32-bit MCUs"
 *
 * - Doc ID 018909 Rev 6, "ST RM0090 Reference manual,
 * STM32F405xx/07xx, STM32F415xx/17xx, STM32F42xxx and STM32F43xxx
 * advanced ARM-based 32-bit MCUs"
 *
 * - Doc ID 026448 Rev 1, "ST RM0383 Reference manual,
 * STM32F411xC/E advanced ARM-based 32-bit MCUs"
 *
 * All STM32 reference manuals available from:
 * http://www.st.com/stonline/stappl/resourceSelector/\
 * app?page=fullResourceSelector&doctype=reference_manual&FamilyID=141
 */

static void stm32_rcc_update_clocks(STM32RCCState *state);

/* ------------------------------------------------------------------------- */

/* STM32F1[LMHX]D */

static PeripheralInfo stm32f1_rcc_info =
        {
            .desc = "Reset and clock control (RCC)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc = "Clock control register (RCC_CR)",
                                    .name = "cr",
                                    .offset_bytes = 0x00,
                                    .reset_value = 0x00000083,
                                    .reset_mask = 0xFFFF00FF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "hsion",
                                                            .desc =
                                                                    "Internal high-speed clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "hsirdy",
                                                            .desc =
                                                                    "Internal high-speed clock ready flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsitrim",
                                                            .desc =
                                                                    "Internal high-speed clock trimming",
                                                            .first_bit = 3,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "hsical",
                                                            .desc =
                                                                    "Internal high-speed clock calibration",
                                                            .first_bit = 8,
                                                            .width_bits = 8,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hseon",
                                                            .desc =
                                                                    "External clock enable",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "hserdy",
                                                            .desc =
                                                                    "External high-speed clock ready flag",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsebyp",
                                                            .desc =
                                                                    "External high-speed clock bypass",
                                                            .first_bit = 18, },
                                                        {
                                                            .name = "csson",
                                                            .desc =
                                                                    "Clock security system enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "pllon",
                                                            .desc = "PLL enable",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pllrdy",
                                                            .desc =
                                                                    "PLL clock ready flag",
                                                            .first_bit = 25,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "Clock configuration register (RCC_CFGR)",
                                    .name = "cfgr",
                                    .offset_bytes = 0x04,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "sw",
                                                            .desc =
                                                                    "System clock switch",
                                                            .first_bit = 0,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "sws",
                                                            .desc =
                                                                    "System clock switch status",
                                                            .first_bit = 2,
                                                            .width_bits = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hpre",
                                                            .desc =
                                                                    "AHB prescaler",
                                                            .first_bit = 4,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "ppre1",
                                                            .desc =
                                                                    "APB low-speed prescaler (APB1)",
                                                            .first_bit = 8,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "ppre2",
                                                            .desc =
                                                                    "APB high-speed prescaler (APB2)",
                                                            .first_bit = 11,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "adcpre",
                                                            .desc =
                                                                    "ADC prescaler",
                                                            .first_bit = 14,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "pllsrc",
                                                            .desc =
                                                                    "PLL entry clock source",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "pllxtpre",
                                                            .desc =
                                                                    "HSE divider for PLL entry",
                                                            .first_bit = 17, },
                                                        {
                                                            .name = "pllmul",
                                                            .desc =
                                                                    "PLL multiplication factor",
                                                            .first_bit = 18,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "usbpre",
                                                            .desc =
                                                                    "USB prescaler",
                                                            .first_bit = 22, },
                                                        {
                                                            .name = "mco",
                                                            .desc =
                                                                    "Microcontroller clock output",
                                                            .first_bit = 24,
                                                            .width_bits = 3, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Clock interrupt register (RCC_CIR)",
                                    .name = "cir",
                                    .offset_bytes = 0x08,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsirdyf",
                                                            .desc =
                                                                    "LSI ready interrupt flag",
                                                            .first_bit = 0,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lserdyf",
                                                            .desc =
                                                                    "LSE ready interrupt flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsirdyf",
                                                            .desc =
                                                                    "HSI ready interrupt flag",
                                                            .first_bit = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hserdyf",
                                                            .desc =
                                                                    "HSE ready interrupt flag",
                                                            .first_bit = 3,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllrdyf",
                                                            .desc =
                                                                    "PLL ready interrupt flag",
                                                            .first_bit = 4,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "cssf",
                                                            .desc =
                                                                    "Clock security system interrupt flag",
                                                            .first_bit = 7,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsirdyie",
                                                            .desc =
                                                                    "LSI ready interrupt enable",
                                                            .first_bit = 8, },
                                                        {
                                                            .name = "lserdyie",
                                                            .desc =
                                                                    "LSE ready interrupt enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "hsirdyie",
                                                            .desc =
                                                                    "HSI ready interrupt enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "hserdyie",
                                                            .desc =
                                                                    "HSE ready interrupt enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "pllrdyie",
                                                            .desc =
                                                                    "PLL ready interrupt enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name = "lsirdyc",
                                                            .desc =
                                                                    "LSI ready interrupt clear",
                                                            .first_bit = 16,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "lserdyc",
                                                            .desc =
                                                                    "LSE ready interrupt clear",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hsirdyc",
                                                            .desc =
                                                                    "HSI ready interrupt clear",
                                                            .first_bit = 18,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hserdyc",
                                                            .desc =
                                                                    "HSE ready interrupt clear",
                                                            .first_bit = 19,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pllrdyc",
                                                            .desc =
                                                                    "PLL ready interrupt clear",
                                                            .first_bit = 20,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "cssc",
                                                            .desc =
                                                                    "Clock security system interrupt clear",
                                                            .first_bit = 23,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "APB2 peripheral reset register (RCC_APB2RSTR)",
                                    .name = "apb2rstr",
                                    .offset_bytes = 0x0C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x0038FFFD,
                                    .writable_bits = 0x0038FFFD, },
                                {
                                    .desc =
                                            "APB1 peripheral reset register (RCC_APB1RSTR)",
                                    .name = "apb1rstr",
                                    .offset_bytes = 0x10,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x3AFEC9FF,
                                    .writable_bits = 0x3AFEC9FF, },
                                {
                                    .desc =
                                            "AHB peripheral clock enable register (RCC_AHBENR)",
                                    .name = "ahbenr",
                                    .offset_bytes = 0x14,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00000557,
                                    .writable_bits = 0x00000557, },
                                {
                                    .desc =
                                            "APB2 peripheral clock enable register (RCC_APB2ENR)",
                                    .name = "apb2enr",
                                    .offset_bytes = 0x18,
                                    .reset_value = 0x00000000,
                                    .bitfields =
