ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "afioen",
                                                            .desc =
                                                                    "Alternate function IO clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "iopaen",
                                                            .desc =
                                                                    "IO port A clock enable",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "iopben",
                                                            .desc =
                                                                    "IO port B clock enable",
                                                            .first_bit = 3, },
                                                        {
                                                            .name = "iopcen",
                                                            .desc =
                                                                    "IO port C clock enable",
                                                            .first_bit = 4, },
                                                        {
                                                            .name = "iopden",
                                                            .desc =
                                                                    "IO port D clock enable",
                                                            .first_bit = 5, },
                                                        {
                                                            .name = "iopeen",
                                                            .desc =
                                                                    "IO port E clock enable",
                                                            .first_bit = 6, },
                                                        {
                                                            .name = "iopfen",
                                                            .desc =
                                                                    "IO port F clock enable",
                                                            .first_bit = 7, },
                                                        {
                                                            .name = "iopgen",
                                                            .desc =
                                                                    "IO port G clock enable",
                                                            .first_bit = 8, },
                                                        {
                                                            .name = "adc1en",
                                                            .desc =
                                                                    "ADC1 interface clock enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "adc2en",
                                                            .desc =
                                                                    "ADC2 interface clock enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "tim1en",
                                                            .desc =
                                                                    "TIM1 timer clock enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "spi1en",
                                                            .desc =
                                                                    "SPI1 clock enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name = "tim8en",
                                                            .desc =
                                                                    "TIM8 timer clock enable",
                                                            .first_bit = 13, },
                                                        {
                                                            .name = "usart1en",
                                                            .desc =
                                                                    "USART1 clock enable",
                                                            .first_bit = 14, },
                                                        {
                                                            .name = "adc3en",
                                                            .desc =
                                                                    "ADC3 interface clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "tim9en",
                                                            .desc =
                                                                    "TIM9 timer clock enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "tim10en",
                                                            .desc =
                                                                    "TIM10 timer clock enable",
                                                            .first_bit = 20, },
                                                        {
                                                            .name = "tim11en",
                                                            .desc =
                                                                    "TIM11 timer clock enable",
                                                            .first_bit = 21, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "APB1 peripheral clock enable register (RCC_APB1ENR)",
                                    .name = "apb1enr",
                                    .offset_bytes = 0x1C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x3AFEC9FF,
                                    .writable_bits = 0x3AFEC9FF, },
                                {
                                    .desc =
                                            "Backup domain control register (RCC_BDCR)",
                                    .name = "bdcr",
                                    .offset_bytes = 0x20,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lseon",
                                                            .desc =
                                                                    "External low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lserdy",
                                                            .desc =
                                                                    "External low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsebyp",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "rtcsel",
                                                            .desc =
                                                                    "RTC clock source selection",
                                                            .first_bit = 8,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "rtcen",
                                                            .desc =
                                                                    "RTC clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "bdrst",
                                                            .desc =
                                                                    "Backup domain software reset",
                                                            .first_bit = 16, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Control/status register (RCC_CSR)",
                                    .name = "csr",
                                    .offset_bytes = 0x24,
                                    .reset_value = 0x0C000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsion",
                                                            .desc =
                                                                    "Internal low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lsirdy",
                                                            .desc =
                                                                    "Internal low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "rmvf",
                                                            .desc =
                                                                    "Remove reset flag",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pinrstf",
                                                            .desc =
                                                                    "PIN reset flag",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "porrstf",
                                                            .desc =
                                                                    "POR/PDR reset flag",
                                                            .first_bit = 27, },
                                                        {
                                                            .name = "stfrstf",
                                                            .desc =
                                                                    "Software reset flag",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "iwdgrstf",
                                                            .desc =
                                                                    "Independent watchdog reset flag",
                                                            .first_bit = 29, },
                                                        {
                                                            .name = "wwdgrstf",
                                                            .desc =
                                                                    "Window watchdog reset flag",
                                                            .first_bit = 30, },
                                                        {
                                                            .name = "lrwrrstf",
                                                            .desc =
                                                                    "Low-power reset flag",
                                                            .first_bit = 31, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                { }, /**/
                            } , /**/
        };

static void stm32f1_rcc_create_objects(Object *obj)
{
    STM32RCCState *state = STM32_RCC_STATE(obj);

    peripheral_new_with_info(obj, NULL, &stm32f1_rcc_info);

