ilg-archived/qemu/hw/cortexm/stm32-rcc.c
    state->f1.reg.cr = cm_object_get_child_by_name(obj, "cr");
    state->f1.reg.cfgr = cm_object_get_child_by_name(obj, "cfgr");
    state->f1.reg.cir = cm_object_get_child_by_name(obj, "cir");
    state->f1.reg.apb2rstr = cm_object_get_child_by_name(obj, "apb2rstr");
    state->f1.reg.apb1rstr = cm_object_get_child_by_name(obj, "apb1rstr");
    state->f1.reg.ahbenr = cm_object_get_child_by_name(obj, "ahbenr");
    state->f1.reg.apb2enr = cm_object_get_child_by_name(obj, "apb2enr");

    state->f1.reg.apb1enr = cm_object_get_child_by_name(obj, "apb1enr");
    state->f1.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f1.reg.csr = cm_object_get_child_by_name(obj, "csr");

    /* CR bitfields. */
    state->f1.cr.hsirdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "hsirdy");
    state->f1.cr.hserdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "hserdy");
    state->f1.cr.pllrdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "pllrdy");

    /* CFGR bitfields. */
    state->f1.cfgr.sws = cm_object_get_child_by_name(state->f1.reg.cfgr, "sws");
    state->f1.cfgr.pllmul = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllmul");
    state->f1.cfgr.pllsrc = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllsrc");
    state->f1.cfgr.pllxtpre = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllxtpre");
    state->f1.cfgr.hpre = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "hpre");

    /* CIR bitfields. */
    state->f1.cir.lsirdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "lsirdyf");
    state->f1.cir.lserdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "lserdyf");
    state->f1.cir.hsirdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "hsirdyf");
    state->f1.cir.hserdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "hserdyf");
    state->f1.cir.pllrdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "pllrdyf");
    state->f1.cir.cssf = cm_object_get_child_by_name(state->f1.reg.cir, "cssf");

    /* BDCR bitfields. */
    state->f1.bdcr.lserdy = cm_object_get_child_by_name(state->f1.reg.bdcr,
            "lserdy");

    /* CSR bitfields. */
    state->f1.csr.lsirdy = cm_object_get_child_by_name(state->f1.reg.csr,
            "lsirdy");
    state->f1.csr.pinrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "pinrstf");
    state->f1.csr.porrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "porrstf");
    state->f1.csr.stfrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "stfrstf");
    state->f1.csr.iwdgrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "iwdgrstf");
    state->f1.csr.wwdgrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "wwdgrstf");
    state->f1.csr.lrwrrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "lrwrrstf");
}

/* ------------------------------------------------------------------------- */

/* STM32F1CL */

static PeripheralInfo stm32f1cl_rcc_info =
        {
            .desc = "Reset and clock control (RCC)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc = "Clock control register (RCC_CR)",
                                    .name = "cr",
                                    .offset_bytes = 0x00,
                                    .reset_value = 0x00000083,
                                    .reset_mask = 0xFFFF00FF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "hsion",
                                                            .desc =
                                                                    "Internal high-speed clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "hsirdy",
                                                            .desc =
                                                                    "Internal high-speed clock ready flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsitrim",
                                                            .desc =
                                                                    "Internal high-speed clock trimming",
                                                            .first_bit = 3,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "hsical",
                                                            .desc =
                                                                    "Internal high-speed clock calibration",
                                                            .first_bit = 8,
                                                            .width_bits = 8,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hseon",
                                                            .desc =
                                                                    "External clock enable",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "hserdy",
                                                            .desc =
                                                                    "External high-speed clock ready flag",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsebyp",
                                                            .desc =
                                                                    "External high-speed clock bypass",
                                                            .first_bit = 18, },
                                                        {
                                                            .name = "csson",
                                                            .desc =
                                                                    "Clock security system enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "pllon",
                                                            .desc = "PLL enable",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pllrdy",
                                                            .desc =
                                                                    "PLL clock ready flag",
                                                            .first_bit = 25,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pll2on",
                                                            .desc =
                                                                    "PLL2 enable",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "pll2rdy",
                                                            .desc =
                                                                    "PLL2 clock ready flag",
                                                            .first_bit = 27,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pll3on",
                                                            .desc =
                                                                    "PLL3 enable",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "pll3rdy",
                                                            .desc =
                                                                    "PLL3 clock ready flag",
                                                            .first_bit = 29,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "Clock configuration register (RCC_CFGR)",
                                    .name = "cfgr",
                                    .offset_bytes = 0x04,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "sw",
                                                            .desc =
                                                                    "System clock switch",
                                                            .first_bit = 0,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "sws",
                                                            .desc =
                                                                    "System clock switch status",
                                                            .first_bit = 2,
                                                            .width_bits = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hpre",
                                                            .desc =
                                                                    "AHB prescaler",
                                                            .first_bit = 4,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "ppre1",
                                                            .desc =
                                                                    "APB low-speed prescaler (APB1)",
                                                            .first_bit = 8,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "ppre2",
                                                            .desc =
                                                                    "APB high-speed prescaler (APB2)",
                                                            .first_bit = 11,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "adcpre",
                                                            .desc =
                                                                    "ADC prescaler",
                                                            .first_bit = 14,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "pllsrc",
                                                            .desc =
                                                                    "PLL entry clock source",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "pllxtpre",
                                                            .desc =
                                                                    "HSE divider for PLL entry",
                                                            .first_bit = 17, },
                                                        {
                                                            .name = "pllmul",
                                                            .desc =
                                                                    "PLL multiplication factor",
                                                            .first_bit = 18,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "otgfspre",
                                                            .desc =
                                                                    "OTG FS prescaler",
                                                            .first_bit = 22, },
                                                        {
                                                            .name = "mco",
                                                            .desc =
                                                                    "Microcontroller clock output",
                                                            .first_bit = 24,
                                                            .width_bits = 3, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Clock interrupt register (RCC_CIR)",
                                    .name = "cir",
                                    .offset_bytes = 0x08,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsirdyf",
                                                            .desc =
                                                                    "LSI ready interrupt flag",
                                                            .first_bit = 0,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lserdyf",
                                                            .desc =
                                                                    "LSE ready interrupt flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsirdyf",
                                                            .desc =
                                                                    "HSI ready interrupt flag",
                                                            .first_bit = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hserdyf",
                                                            .desc =
                                                                    "HSE ready interrupt flag",
                                                            .first_bit = 3,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllrdyf",
                                                            .desc =
                                                                    "PLL ready interrupt flag",
                                                            .first_bit = 4,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pll2rdyf",
                                                            .desc =
                                                                    "PLL2 ready interrupt flag",
                                                            .first_bit = 5,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pll3rdyf",
                                                            .desc =
                                                                    "PLL3 ready interrupt flag",
                                                            .first_bit = 6,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "cssf",
                                                            .desc =
                                                                    "Clock security system interrupt flag",
                                                            .first_bit = 7,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsirdyie",
                                                            .desc =
                                                                    "LSI ready interrupt enable",
                                                            .first_bit = 8, },
                                                        {
                                                            .name = "lserdyie",
                                                            .desc =
                                                                    "LSE ready interrupt enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "hsirdyie",
                                                            .desc =
                                                                    "HSI ready interrupt enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "hserdyie",
                                                            .desc =
                                                                    "HSE ready interrupt enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "pllrdyie",
                                                            .desc =
                                                                    "PLL ready interrupt enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name = "pll2rdyie",
                                                            .desc =
                                                                    "PLL2 ready interrupt enable",
                                                            .first_bit = 13, },
                                                        {
                                                            .name = "pll3rdyie",
                                                            .desc =
                                                                    "PLL3 ready interrupt enable",
                                                            .first_bit = 14, },
                                                        {
                                                            .name = "lsirdyc",
                                                            .desc =
                                                                    "LSI ready interrupt clear",
                                                            .first_bit = 16,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "lserdyc",
