ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                                            .desc =
                                                                    "LSE ready interrupt clear",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hsirdyc",
                                                            .desc =
                                                                    "HSI ready interrupt clear",
                                                            .first_bit = 18,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hserdyc",
                                                            .desc =
                                                                    "HSE ready interrupt clear",
                                                            .first_bit = 19,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pllrdyc",
                                                            .desc =
                                                                    "PLL ready interrupt clear",
                                                            .first_bit = 20,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pll2rdyc",
                                                            .desc =
                                                                    "PLL2 ready interrupt clear",
                                                            .first_bit = 21,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pll3rdyc",
                                                            .desc =
                                                                    "PLL3 ready interrupt clear",
                                                            .first_bit = 22,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "cssc",
                                                            .desc =
                                                                    "Clock security system interrupt clear",
                                                            .first_bit = 23,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "APB2 peripheral reset register (RCC_APB2RSTR)",
                                    .name = "apb2rstr",
                                    .offset_bytes = 0x0C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00005E7D,
                                    .writable_bits = 0x00005E7D, },
                                {
                                    .desc =
                                            "APB1 peripheral reset register (RCC_APB1RSTR)",
                                    .name = "apb1rstr",
                                    .offset_bytes = 0x10,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x377EC83F,
                                    .writable_bits = 0x377EC83F, },
                                {
                                    .desc =
                                            "AHB peripheral clock enable register (RCC_AHBENR)",
                                    .name = "ahbenr",
                                    .offset_bytes = 0x14,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x0001D057,
                                    .writable_bits = 0x0001D057, },
                                {
                                    .desc =
                                            "APB2 peripheral clock enable register (RCC_APB2ENR)",
                                    .name = "apb2enr",
                                    .offset_bytes = 0x18,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "afioen",
                                                            .desc =
                                                                    "Alternate function IO clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "iopaen",
                                                            .desc =
                                                                    "IO port A clock enable",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "iopben",
                                                            .desc =
                                                                    "IO port B clock enable",
                                                            .first_bit = 3, },
                                                        {
                                                            .name = "iopcen",
                                                            .desc =
                                                                    "IO port C clock enable",
                                                            .first_bit = 4, },
                                                        {
                                                            .name = "iopden",
                                                            .desc =
                                                                    "IO port D clock enable",
                                                            .first_bit = 5, },
                                                        {
                                                            .name = "iopeen",
                                                            .desc =
                                                                    "IO port E clock enable",
                                                            .first_bit = 6, },
                                                        {
                                                            .name = "adc1en",
                                                            .desc =
                                                                    "ADC1 interface clock enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "adc2en",
                                                            .desc =
                                                                    "ADC2 interface clock enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "tim1en",
                                                            .desc =
                                                                    "TIM1 timer clock enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "spi1en",
                                                            .desc =
                                                                    "SPI1 clock enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name = "usart1en",
                                                            .desc =
                                                                    "USART1 clock enable",
                                                            .first_bit = 14, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "APB1 peripheral clock enable register (RCC_APB1ENR)",
                                    .name = "apb1enr",
                                    .offset_bytes = 0x1C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x3E7EC83F,
                                    .writable_bits = 0x3E7EC83F, },
                                {
                                    .desc =
                                            "Backup domain control register (RCC_BDCR)",
                                    .name = "bdcr",
                                    .offset_bytes = 0x20,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lseon",
                                                            .desc =
                                                                    "External low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lserdy",
                                                            .desc =
                                                                    "External low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsebyp",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "rtcsel",
                                                            .desc =
                                                                    "RTC clock source selection",
                                                            .first_bit = 8,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "rtcen",
                                                            .desc =
                                                                    "RTC clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "bdrst",
                                                            .desc =
                                                                    "Backup domain software reset",
                                                            .first_bit = 16, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Control/status register (RCC_CSR)",
                                    .name = "csr",
                                    .offset_bytes = 0x24,
                                    .reset_value = 0x0C000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsion",
                                                            .desc =
                                                                    "Internal low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lsirdy",
                                                            .desc =
                                                                    "Internal low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "rmvf",
                                                            .desc =
                                                                    "Remove reset flag",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pinrstf",
                                                            .desc =
                                                                    "PIN reset flag",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "porrstf",
                                                            .desc =
                                                                    "POR/PDR reset flag",
                                                            .first_bit = 27, },
                                                        {
                                                            .name = "stfrstf",
                                                            .desc =
                                                                    "Software reset flag",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "iwdgrstf",
                                                            .desc =
                                                                    "Independent watchdog reset flag",
                                                            .first_bit = 29, },
                                                        {
                                                            .name = "wwdgrstf",
                                                            .desc =
                                                                    "Window watchdog reset flag",
                                                            .first_bit = 30, },
                                                        {
                                                            .name = "lrwrrstf",
                                                            .desc =
                                                                    "Low-power reset flag",
                                                            .first_bit = 31, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "AHB peripheral clock reset register (RCC_AHBRSTR)",
                                    .name = "ahbrstr",
                                    .offset_bytes = 0x28,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00005000,
                                    .writable_bits = 0x00005000, },
                                {
                                    .desc =
                                            "Clock configuration register2 (RCC_CFGR2)",
                                    .name = "cfgr2",
                                    .offset_bytes = 0x2C,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "prediv1",
                                                            .desc =
                                                                    "PREDIV1 division factor",
                                                            .first_bit = 0,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "prediv2",
                                                            .desc =
                                                                    "PREDIV2 division factor",
                                                            .first_bit = 4,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "pll2mul",
                                                            .desc =
                                                                    "PLL2 Multiplication factor",
                                                            .first_bit = 8,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "pll3mul",
                                                            .desc =
                                                                    "PLL3 Multiplication factor",
                                                            .first_bit = 12,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "prediv1src",
                                                            .desc =
                                                                    "PREDIV1 entry clock source",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "i2s2src",
                                                            .desc =
                                                                    "I2S2 clock source",
                                                            .first_bit = 17, },
                                                        {
                                                            .name = "i2s3src",
                                                            .desc =
                                                                    "I2S2 clock source",
                                                            .first_bit = 18, },
                                                        { }, /**/
                                                    } , /**/
                                },

                                { }, /**/
                            } , /**/
        };

static void stm32f1cl_rcc_create_objects(Object *obj)
{
    STM32RCCState *state = STM32_RCC_STATE(obj);

    peripheral_new_with_info(obj, NULL, &stm32f1cl_rcc_info);

