ilg-archived/qemu/hw/cortexm/stm32-rcc.c
    state->f1.reg.cr = cm_object_get_child_by_name(obj, "cr");
    state->f1.reg.cfgr = cm_object_get_child_by_name(obj, "cfgr");
    state->f1.reg.cir = cm_object_get_child_by_name(obj, "cir");
    state->f1.reg.apb2rstr = cm_object_get_child_by_name(obj, "apb2rstr");
    state->f1.reg.apb1rstr = cm_object_get_child_by_name(obj, "apb1rstr");
    state->f1.reg.ahbenr = cm_object_get_child_by_name(obj, "ahbenr");
    state->f1.reg.apb2enr = cm_object_get_child_by_name(obj, "apb2enr");

    state->f1.reg.apb1enr = cm_object_get_child_by_name(obj, "apb1enr");
    state->f1.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f1.reg.csr = cm_object_get_child_by_name(obj, "csr");

    state->f1.reg.ahbrstr = cm_object_get_child_by_name(obj, "ahbrstr");
    state->f1.reg.cfgr2 = cm_object_get_child_by_name(obj, "cfgr2");

    /* CR bitfields. */
    state->f1.cr.hsirdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "hsirdy");
    state->f1.cr.hserdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "hserdy");
    state->f1.cr.pllrdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "pllrdy");
    state->f1.cr.pll2rdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "pll2rdy");
    state->f1.cr.pll3rdy = cm_object_get_child_by_name(state->f1.reg.cr,
            "pll3rdy");

    /* CFGR bitfields. */
    state->f1.cfgr.sws = cm_object_get_child_by_name(state->f1.reg.cfgr, "sws");
    state->f1.cfgr.pllmul = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllmul");
    state->f1.cfgr.pllsrc = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllsrc");
    state->f1.cfgr.pllxtpre = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "pllxtpre");
    state->f1.cfgr.hpre = cm_object_get_child_by_name(state->f1.reg.cfgr,
            "hpre");

    /* CIR bitfields. */
    state->f1.cir.lsirdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "lsirdyf");
    state->f1.cir.lserdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "lserdyf");
    state->f1.cir.hsirdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "hsirdyf");
    state->f1.cir.hserdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "hserdyf");
    state->f1.cir.pllrdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "pllrdyf");
    state->f1.cir.pll2rdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "pll2rdyf");
    state->f1.cir.pll3rdyf = cm_object_get_child_by_name(state->f1.reg.cir,
            "pll3rdyf");
    state->f1.cir.cssf = cm_object_get_child_by_name(state->f1.reg.cir, "cssf");

    /* BDCR bitfields. */
    state->f1.bdcr.lserdy = cm_object_get_child_by_name(state->f1.reg.bdcr,
            "lserdy");

    /* CSR bitfields. */
    state->f1.csr.lsirdy = cm_object_get_child_by_name(state->f1.reg.csr,
            "lsirdy");
    state->f1.csr.pinrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "pinrstf");
    state->f1.csr.porrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "porrstf");
    state->f1.csr.stfrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "stfrstf");
    state->f1.csr.iwdgrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "iwdgrstf");
    state->f1.csr.wwdgrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "wwdgrstf");
    state->f1.csr.lrwrrstf = cm_object_get_child_by_name(state->f1.reg.csr,
            "lrwrrstf");

    /* CFGR2 bitfields. */
    state->f1.cfgr2.prediv1 = cm_object_get_child_by_name(state->f1.reg.cfgr2,
            "prediv1");
    state->f1.cfgr2.prediv2 = cm_object_get_child_by_name(state->f1.reg.cfgr2,
            "prediv2");
    state->f1.cfgr2.pll2mul = cm_object_get_child_by_name(state->f1.reg.cfgr2,
            "pll2mul");
    state->f1.cfgr2.prediv1src = cm_object_get_child_by_name(
            state->f1.reg.cfgr2, "prediv1src");
}

/* ------------------------------------------------------------------------- */

/* STM32F4_01_57_xx */

static PeripheralInfo stm32f4_01_57_xx_rcc_info =
        {
            .desc = "Reset and clock control (RCC)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc = "Clock control register (RCC_CR)",
                                    .name = "cr",
                                    .offset_bytes = 0x00,
                                    .reset_value = 0x00000083,
                                    .reset_mask = 0xFFFF00FF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "hsion",
                                                            .desc =
                                                                    "Internal high-speed clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "hsirdy",
                                                            .desc =
                                                                    "Internal high-speed clock ready flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsitrim",
                                                            .desc =
                                                                    "Internal high-speed clock trimming",
                                                            .first_bit = 3,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "hsical",
                                                            .desc =
                                                                    "Internal high-speed clock calibration",
                                                            .first_bit = 8,
                                                            .width_bits = 8,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hseon",
                                                            .desc =
                                                                    "External clock enable",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "hserdy",
                                                            .desc =
                                                                    "External high-speed clock ready flag",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsebyp",
                                                            .desc =
                                                                    "External high-speed clock bypass",
                                                            .first_bit = 18, },
                                                        {
                                                            .name = "csson",
                                                            .desc =
                                                                    "Clock security system enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "pllon",
                                                            .desc = "PLL enable",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pllrdy",
                                                            .desc =
                                                                    "PLL clock ready flag",
                                                            .first_bit = 25,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "plli2son",
                                                            .desc =
                                                                    "PLL I2S enable",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "plli2srdy",
                                                            .desc =
                                                                    "PLL I2S clock ready flag",
                                                            .first_bit = 27,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },

