ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00377F33,
                                    .writable_bits = 0x00377F33, },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR)",
                                    .name = "ahb1lpenr",
                                    .offset_bytes = 0x50,
                                    .reset_value = 0x7E6791FF,
                                    .readable_bits = 0x7E6791FF,
                                    .writable_bits = 0x7E6791FF, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR)",
                                    .name = "ahb2lpenr",
                                    .offset_bytes = 0x54,
                                    .reset_value = 0x000000F1,
                                    .readable_bits = 0x000000F1,
                                    .writable_bits = 0x000000F1, },
                                {
                                    .desc =
                                            "RCC AHB3 peripheral clock enable in low power mode register (RCC_AHB3LPENR)",
                                    .name = "ahb3lpenr",
                                    .offset_bytes = 0x58,
                                    .reset_value = 0x00000001,
                                    .readable_bits = 0x00000001,
                                    .writable_bits = 0x00000001, },
                                {
                                    .desc =
                                            "RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR)",
                                    .name = "apb1lpenr",
                                    .offset_bytes = 0x60,
                                    .reset_value = 0x36FEC9FF,
                                    .readable_bits = 0x3EFEC9FF,
                                    .writable_bits = 0x3EFEC9FF, },
                                {
                                    .desc =
                                            "RCC APB2 peripheral clock enable in low power mode register (RCC_APB2LPENR)",
                                    .name = "apb2lpenr",
                                    .offset_bytes = 0x64,
                                    .reset_value = 0x00075F33,
                                    .readable_bits = 0x00079F33,
                                    .writable_bits = 0x00079F33, },
                                {
                                    .desc =
                                            "RCC Backup domain control register (RCC_BDCR)",
                                    .name = "bdcr",
                                    .offset_bytes = 0x70,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lseon",
                                                            .desc =
                                                                    "External low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lserdy",
                                                            .desc =
                                                                    "External low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsebyp",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "rtcsel",
                                                            .desc =
                                                                    "RTC clock source selection",
                                                            .first_bit = 8,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "rtcen",
                                                            .desc =
                                                                    "RTC clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "bdrst",
                                                            .desc =
                                                                    "Backup domain software reset",
                                                            .first_bit = 16, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Control/status register (RCC_CSR)",
                                    .name = "csr",
                                    .offset_bytes = 0x74,
                                    .reset_value = 0x0E000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsion",
                                                            .desc =
                                                                    "Internal low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lsirdy",
                                                            .desc =
                                                                    "Internal low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "rmvf",
                                                            .desc =
                                                                    "Remove reset flag",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "borrstf",
                                                            .desc =
                                                                    "BOR reset flag",
                                                            .first_bit = 25, },
                                                        {
                                                            .name = "pinrstf",
                                                            .desc =
                                                                    "PIN reset flag",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "porrstf",
                                                            .desc =
                                                                    "POR/PDR reset flag",
                                                            .first_bit = 27, },
                                                        {
                                                            .name = "stfrstf",
                                                            .desc =
                                                                    "Software reset flag",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "iwdgrstf",
                                                            .desc =
                                                                    "Independent watchdog reset flag",
                                                            .first_bit = 29, },
                                                        {
                                                            .name = "wwdgrstf",
                                                            .desc =
                                                                    "Window watchdog reset flag",
                                                            .first_bit = 30, },
                                                        {
                                                            .name = "lpwrrstf",
                                                            .desc =
                                                                    "Low-power reset flag",
                                                            .first_bit = 31, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "RCC spread spectrum clock generation register (RCC_SSCGR)",
                                    .name = "sscgr",
                                    .offset_bytes = 0x80,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0xCEFFFFFF,
                                    .writable_bits = 0xCEFFFFFF, },
                                {
                                    .desc =
                                            "RCC PLLI2S configuration register (RCC_PLLI2SCFGR)",
                                    .name = "plli2scfgr",
                                    .offset_bytes = 0x84,
                                    .reset_value = 0x20003000,
                                    .readable_bits = 0x70007FC0,
                                    .writable_bits = 0x70007FC0, },
                                { }, /**/
                            } , /**/
        };

static void stm32f4_01_57_xx_rcc_create_objects(Object *obj)
{
    STM32RCCState *state = STM32_RCC_STATE(obj);

    peripheral_new_with_info(obj, NULL, &stm32f4_01_57_xx_rcc_info);

    state->f4.reg.cr = cm_object_get_child_by_name(obj, "cr");
    state->f4.reg.pllcfgr = cm_object_get_child_by_name(obj, "pllcfgr");
    state->f4.reg.cfgr = cm_object_get_child_by_name(obj, "cfgr");
    state->f4.reg.cir = cm_object_get_child_by_name(obj, "cir");
    state->f4.reg.ahb1rstr = cm_object_get_child_by_name(obj, "ahb1rstr");
    state->f4.reg.ahb2rstr = cm_object_get_child_by_name(obj, "ahb2rstr");
    state->f4.reg.ahb3rstr = cm_object_get_child_by_name(obj, "ahb3rstr");
    state->f4.reg.apb1rstr = cm_object_get_child_by_name(obj, "apb1rstr");
    state->f4.reg.apb2rstr = cm_object_get_child_by_name(obj, "apb2rstr");
    state->f4.reg.ahb1enr = cm_object_get_child_by_name(obj, "ahb1enr");
    state->f4.reg.ahb2enr = cm_object_get_child_by_name(obj, "ahb2enr");
    state->f4.reg.ahb3enr = cm_object_get_child_by_name(obj, "ahb3enr");
    state->f4.reg.apb1enr = cm_object_get_child_by_name(obj, "apb1enr");
    state->f4.reg.apb2enr = cm_object_get_child_by_name(obj, "apb2enr");
    state->f4.reg.ahb1lpenr = cm_object_get_child_by_name(obj, "ahb1lpenr");
    state->f4.reg.ahb2lpenr = cm_object_get_child_by_name(obj, "ahb2lpenr");
    state->f4.reg.ahb3lpenr = cm_object_get_child_by_name(obj, "ahb3lpenr");
    state->f4.reg.apb1lpenr = cm_object_get_child_by_name(obj, "apb1lpenr");
    state->f4.reg.apb2lpenr = cm_object_get_child_by_name(obj, "apb2lpenr");
    state->f4.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f4.reg.csr = cm_object_get_child_by_name(obj, "csr");
    state->f4.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f4.reg.sscgr = cm_object_get_child_by_name(obj, "sscgr");

    /* CR bitfields. */
    state->f4.fld.cr.hsion = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsion");
    state->f4.fld.cr.hsirdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsirdy");
    state->f4.fld.cr.hsitrim = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsitrim");
    state->f4.fld.cr.hsical = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsical");
    state->f4.fld.cr.hseon = cm_object_get_child_by_name(state->f4.reg.cr,
            "hseon");
    state->f4.fld.cr.hserdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "hserdy");
    state->f4.fld.cr.hsebyp = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsebyp");
    state->f4.fld.cr.csson = cm_object_get_child_by_name(state->f4.reg.cr,
            "csson");
    state->f4.fld.cr.pllon = cm_object_get_child_by_name(state->f4.reg.cr,
            "pllon");
    state->f4.fld.cr.pllrdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "pllrdy");
    state->f4.fld.cr.plli2son = cm_object_get_child_by_name(state->f4.reg.cr,
            "plli2son");
    state->f4.fld.cr.plli2srdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "plli2srdy");

    /* PLLCFGR bitfields. */
    state->f4.fld.pllcfgr.pllm = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllm");
    state->f4.fld.pllcfgr.plln = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "plln");
    state->f4.fld.pllcfgr.pllp = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllp");
    state->f4.fld.pllcfgr.pllsrc = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllsrc");
    state->f4.fld.pllcfgr.pllq = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllq");

    /* CFGR bitfields. */
    state->f4.fld.cfgr.sw = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "sw");
    state->f4.fld.cfgr.sws = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "sws");
    state->f4.fld.cfgr.hpre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "hpre");
    state->f4.fld.cfgr.ppre1 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "ppre1");
    state->f4.fld.cfgr.ppre2 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "ppre2");
    state->f4.fld.cfgr.rtcpre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "rtcpre");
    state->f4.fld.cfgr.mco1 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco1");
    state->f4.fld.cfgr.i2ssrc = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "i2ssrc");
    state->f4.fld.cfgr.mco1pre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco1pre");
    state->f4.fld.cfgr.mco2pre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco2pre");
    state->f4.fld.cfgr.mco2 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco2");

