ilg-archived/qemu/hw/cortexm/stm32-rcc.c
    /* CIR bitfields. */
    state->f4.fld.cir.lsirdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "lsirdyf");
    state->f4.fld.cir.lserdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "lserdyf");
    state->f4.fld.cir.hsirdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "hsirdyf");
    state->f4.fld.cir.hserdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "hserdyf");
    state->f4.fld.cir.pllrdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "pllrdyf");
    state->f4.fld.cir.plli2srdyf = cm_object_get_child_by_name(
            state->f4.reg.cir, "plli2srdyf");
    state->f4.fld.cir.cssf = cm_object_get_child_by_name(state->f4.reg.cir,
            "cssf");

    /* BDCR bitfields. */
    state->f4.fld.bdcr.lserdy = cm_object_get_child_by_name(state->f4.reg.bdcr,
            "lserdy");

    /* CSR bitfields. */
    state->f4.fld.csr.lsirdy = cm_object_get_child_by_name(state->f4.reg.csr,
            "lsirdy");
    state->f4.fld.csr.pinrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "pinrstf");
    state->f4.fld.csr.porrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "porrstf");
    state->f4.fld.csr.stfrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "stfrstf");
    state->f4.fld.csr.iwdgrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "iwdgrstf");
    state->f4.fld.csr.wwdgrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "wwdgrstf");
    state->f4.fld.csr.lpwrrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "lpwrrstf");

}

/* ------------------------------------------------------------------------- */

/* STM32F411xx */

static PeripheralInfo stm32f411xx_rcc_info =
        {
            .desc = "Reset and clock control (RCC)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc = "Clock control register (RCC_CR)",
                                    .name = "cr",
                                    .offset_bytes = 0x00,
                                    .reset_value = 0x00000083, /* not 81 */
                                    .reset_mask = 0xFFFF00FF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "hsion",
                                                            .desc =
                                                                    "Internal high-speed clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "hsirdy",
                                                            .desc =
                                                                    "Internal high-speed clock ready flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsitrim",
                                                            .desc =
                                                                    "Internal high-speed clock trimming",
                                                            .first_bit = 3,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "hsical",
                                                            .desc =
                                                                    "Internal high-speed clock calibration",
                                                            .first_bit = 8,
                                                            .width_bits = 8,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hseon",
                                                            .desc =
                                                                    "External clock enable",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "hserdy",
                                                            .desc =
                                                                    "External high-speed clock ready flag",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsebyp",
                                                            .desc =
                                                                    "External high-speed clock bypass",
                                                            .first_bit = 18, },
                                                        {
                                                            .name = "csson",
                                                            .desc =
                                                                    "Clock security system enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "pllon",
                                                            .desc = "PLL enable",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pllrdy",
                                                            .desc =
                                                                    "PLL clock ready flag",
                                                            .first_bit = 25,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "plli2son",
                                                            .desc =
                                                                    "PLL I2S enable",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "plli2srdy",
                                                            .desc =
                                                                    "PLL I2S clock ready flag",
                                                            .first_bit = 27,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },

