ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                                        { }, /**/
                                                    } , /**/},
                                {
                                    .desc =
                                            "RCC PLL configuration register (RCC_PLLCFGR)",
                                    .name = "pllcfgr",
                                    .offset_bytes = 0x04,
                                    .reset_value = 0x24003010,
                                    .readable_bits = 0x0F437FFF,
                                    .writable_bits = 0x0F437FFF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "pllm",
                                                            .desc =
                                                                    "PLL division factor",
                                                            .first_bit = 0,
                                                            .width_bits = 6, },
                                                        {
                                                            .name = "plln",
                                                            .desc =
                                                                    "PLL multiplication factor",
                                                            .first_bit = 6,
                                                            .width_bits = 9, },
                                                        {
                                                            .name = "pllp",
                                                            .desc =
                                                                    "Main PLL (PLL) division factor",
                                                            .first_bit = 16,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "pllsrc",
                                                            .desc =
                                                                    "Main PLL (PLL) clock source",
                                                            .first_bit = 22, },
                                                        {
                                                            .name = "pllq",
                                                            .desc =
                                                                    "Main PLL (PLL) division factor",
                                                            .first_bit = 24,
                                                            .width_bits = 4, },
                                                        { }, } , },
                                {
                                    .desc =
                                            "RCC clock configuration register (RCC_CFGR)",
                                    .name = "cfgr",
                                    .offset_bytes = 0x08,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "sw",
                                                            .desc =
                                                                    "System clock switch",
                                                            .first_bit = 0,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "sws",
                                                            .desc =
                                                                    "System clock switch status",
                                                            .first_bit = 2,
                                                            .width_bits = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hpre",
                                                            .desc =
                                                                    "AHB prescaler",
                                                            .first_bit = 4,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "ppre1",
                                                            .desc =
                                                                    "APB Low speed prescaler (APB1)",
                                                            .first_bit = 10,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "ppre2",
                                                            .desc =
                                                                    "APB high speed prescaler (APB2)",
                                                            .first_bit = 13,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "rtcpre",
                                                            .desc =
                                                                    "HSE division factor for RTC clock",
                                                            .first_bit = 16,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "mco1",
                                                            .desc =
                                                                    "Microcontroller clock output 1",
                                                            .first_bit = 21,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "i2ssrc",
                                                            .desc =
                                                                    "I2S clock selection",
                                                            .first_bit = 23, },
                                                        {
                                                            .name = "mco1pre",
                                                            .desc =
                                                                    "MCO1 prescaller",
                                                            .first_bit = 24,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "mco2pre",
                                                            .desc =
                                                                    "MCO2 prescaller",
                                                            .first_bit = 27,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "mco2",
                                                            .desc =
                                                                    "Microcontroller clock output 2",
                                                            .first_bit = 30,
                                                            .width_bits = 2, },
                                                        { }, /**/
                                                    } , /**/},
                                {
                                    .desc = "Clock interrupt register (RCC_CIR)",
                                    .name = "cir",
                                    .offset_bytes = 0x0C,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsirdyf",
                                                            .desc =
                                                                    "LSI ready interrupt flag",
                                                            .first_bit = 0,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lserdyf",
                                                            .desc =
                                                                    "LSE ready interrupt flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsirdyf",
                                                            .desc =
                                                                    "HSI ready interrupt flag",
                                                            .first_bit = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hserdyf",
                                                            .desc =
                                                                    "HSE ready interrupt flag",
                                                            .first_bit = 3,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllrdyf",
                                                            .desc =
                                                                    "PLL ready interrupt flag",
                                                            .first_bit = 4,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "plli2srdyf",
                                                            .desc =
                                                                    "PLL I2S ready interrupt flag",
                                                            .first_bit = 5,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "cssf",
                                                            .desc =
                                                                    "Clock security system interrupt flag",
                                                            .first_bit = 7,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsirdyie",
                                                            .desc =
                                                                    "LSI ready interrupt enable",
                                                            .first_bit = 8, },
                                                        {
                                                            .name = "lserdyie",
                                                            .desc =
                                                                    "LSE ready interrupt enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "hsirdyie",
                                                            .desc =
                                                                    "HSI ready interrupt enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "hserdyie",
                                                            .desc =
                                                                    "HSE ready interrupt enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "pllrdyie",
                                                            .desc =
                                                                    "PLL ready interrupt enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name =
                                                                    "plli2srdyie",
                                                            .desc =
                                                                    "PLL I2S ready interrupt enable",
                                                            .first_bit = 13, },
                                                        {
                                                            .name = "lsirdyc",
                                                            .desc =
                                                                    "LSI ready interrupt clear",
                                                            .first_bit = 16,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "lserdyc",
                                                            .desc =
                                                                    "LSE ready interrupt clear",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hsirdyc",
                                                            .desc =
                                                                    "HSI ready interrupt clear",
                                                            .first_bit = 18,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hserdyc",
                                                            .desc =
                                                                    "HSE ready interrupt clear",
                                                            .first_bit = 19,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pllrdyc",
                                                            .desc =
                                                                    "PLL ready interrupt clear",
                                                            .first_bit = 20,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "plli2srdyc",
                                                            .desc =
                                                                    "PLL I2S ready interrupt clear",
                                                            .first_bit = 21,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "cssc",
                                                            .desc =
                                                                    "Clock security system interrupt clear",
                                                            .first_bit = 23,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral reset register (RCC_AHB1RSTR)",
                                    .name = "ahb1rstr",
                                    .offset_bytes = 0x10,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x0060109F,
                                    .writable_bits = 0x0060109F, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral reset register (RCC_AHB2RSTR)",
                                    .name = "ahb2rstr",
                                    .offset_bytes = 0x14,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00000080,
                                    .writable_bits = 0x00000080, },
                                {
                                    .desc =
                                            "RCC APB1 peripheral reset register (RCC_APB1RSTR)",
                                    .name = "apb1rstr",
                                    .offset_bytes = 0x20,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x10E2C80F,
                                    .writable_bits = 0x10E2C80F, },
                                {
                                    .desc =
                                            "RCC APB2 peripheral reset register (RCC_APB2RSTR)",
                                    .name = "apb2rstr",
                                    .offset_bytes = 0x24,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00177931,
                                    .writable_bits = 0x00177931, },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral clock enable register (RCC_AHB1ENR)",
                                    .name = "ahb1enr",
                                    .offset_bytes = 0x30,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x0050101F,
                                    .writable_bits = 0x0050101F, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral clock enable register (RCC_AHB2ENR)",
                                    .name = "ahb2enr",
                                    .offset_bytes = 0x34,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00000080,
                                    .writable_bits = 0x00000080, },
                                {
                                    .desc =
                                            "APB1 peripheral clock enable register (RCC_APB1ENR)",
                                    .name = "apb1enr",
                                    .offset_bytes = 0x40,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x10E2C80F,
                                    .writable_bits = 0x10E2C80F, },
                                {
                                    .desc =
                                            "APB2 peripheral clock enable register (RCC_APB2ENR)",
                                    .name = "apb2enr",
                                    .offset_bytes = 0x44,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00177931,
                                    .writable_bits = 0x00177931, },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR)",
                                    .name = "ahb1lpenr",
                                    .offset_bytes = 0x50,
                                    .reset_value = 0x0061900F,
                                    .readable_bits = 0x0061909F,
                                    .writable_bits = 0x0061909F, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR)",
                                    .name = "ahb2lpenr",
                                    .offset_bytes = 0x54,
