ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                    .reset_value = 0x00000080,
                                    .readable_bits = 0x00000080,
                                    .writable_bits = 0x00000080, },
                                {
                                    .desc =
                                            "RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR)",
                                    .name = "apb1lpenr",
                                    .offset_bytes = 0x60,
                                    .reset_value = 0x10E2C80F,
                                    .readable_bits = 0x10E2C80F,
                                    .writable_bits = 0x10E2C80F, },
                                {
                                    .desc =
                                            "RCC APB2 peripheral clock enable in low power mode register (RCC_APB2LPENR)",
                                    .name = "apb2lpenr",
                                    .offset_bytes = 0x64,
                                    .reset_value = 0x00077930,
                                    .readable_bits = 0x00179F31,
                                    .writable_bits = 0x00179F31, },
                                {
                                    .desc =
                                            "RCC Backup domain control register (RCC_BDCR)",
                                    .name = "bdcr",
                                    .offset_bytes = 0x70,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lseon",
                                                            .desc =
                                                                    "External low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lserdy",
                                                            .desc =
                                                                    "External low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsebyp",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "lsemod",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 3, },
                                                        {
                                                            .name = "rtcsel",
                                                            .desc =
                                                                    "RTC clock source selection",
                                                            .first_bit = 8,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "rtcen",
                                                            .desc =
                                                                    "RTC clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "bdrst",
                                                            .desc =
                                                                    "Backup domain software reset",
                                                            .first_bit = 16, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Control/status register (RCC_CSR)",
                                    .name = "csr",
                                    .offset_bytes = 0x74,
                                    .reset_value = 0x0E000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsion",
                                                            .desc =
                                                                    "Internal low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lsirdy",
                                                            .desc =
                                                                    "Internal low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "rmvf",
                                                            .desc =
                                                                    "Remove reset flag",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "borrstf",
                                                            .desc =
                                                                    "BOR reset flag",
                                                            .first_bit = 25, },
                                                        {
                                                            .name = "pinrstf",
                                                            .desc =
                                                                    "PIN reset flag",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "porrstf",
                                                            .desc =
                                                                    "POR/PDR reset flag",
                                                            .first_bit = 27, },
                                                        {
                                                            .name = "stfrstf",
                                                            .desc =
                                                                    "Software reset flag",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "iwdgrstf",
                                                            .desc =
                                                                    "Independent watchdog reset flag",
                                                            .first_bit = 29, },
                                                        {
                                                            .name = "wwdgrstf",
                                                            .desc =
                                                                    "Window watchdog reset flag",
                                                            .first_bit = 30, },
                                                        {
                                                            .name = "lpwrrstf",
                                                            .desc =
                                                                    "Low-power reset flag",
                                                            .first_bit = 31, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "RCC spread spectrum clock generation register (RCC_SSCGR)",
                                    .name = "sscgr",
                                    .offset_bytes = 0x80,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0xE0FFFFFF,
                                    .writable_bits = 0xE0FFFFFF, },
                                {
                                    .desc =
                                            "RCC PLLI2S configuration register (RCC_PLLI2SCFGR)",
                                    .name = "plli2scfgr",
                                    .offset_bytes = 0x84,
                                    .reset_value = 0x24003000,
                                    .readable_bits = 0x70007FFF,
                                    .writable_bits = 0x70007FFF, },
                                {
                                    .desc =
                                            "RCC Dedicated Clocks Configuration Register (RCC_DCKCFGR)",
                                    .name = "dckcfgr",
                                    .offset_bytes = 0x8C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x01000000,
                                    .writable_bits = 0x01000000, },
                                { }, /**/
                            } , /**/
        };

static void stm32f411xx_rcc_create_objects(Object *obj)
{
    STM32RCCState *state = STM32_RCC_STATE(obj);

