ilg-archived/qemu/hw/cortexm/stm32-rcc.c
    peripheral_new_with_info(obj, NULL, &stm32f411xx_rcc_info);

    state->f4.reg.cr = cm_object_get_child_by_name(obj, "cr");
    state->f4.reg.pllcfgr = cm_object_get_child_by_name(obj, "pllcfgr");
    state->f4.reg.cfgr = cm_object_get_child_by_name(obj, "cfgr");
    state->f4.reg.cir = cm_object_get_child_by_name(obj, "cir");
    state->f4.reg.ahb1rstr = cm_object_get_child_by_name(obj, "ahb1rstr");
    state->f4.reg.ahb2rstr = cm_object_get_child_by_name(obj, "ahb2rstr");
    state->f4.reg.apb1rstr = cm_object_get_child_by_name(obj, "apb1rstr");
    state->f4.reg.apb2rstr = cm_object_get_child_by_name(obj, "apb2rstr");
    state->f4.reg.ahb1enr = cm_object_get_child_by_name(obj, "ahb1enr");
    state->f4.reg.ahb2enr = cm_object_get_child_by_name(obj, "ahb2enr");
    state->f4.reg.apb1enr = cm_object_get_child_by_name(obj, "apb1enr");
    state->f4.reg.apb2enr = cm_object_get_child_by_name(obj, "apb2enr");
    state->f4.reg.ahb1lpenr = cm_object_get_child_by_name(obj, "ahb1lpenr");
    state->f4.reg.ahb2lpenr = cm_object_get_child_by_name(obj, "ahb2lpenr");
    state->f4.reg.apb1lpenr = cm_object_get_child_by_name(obj, "apb1lpenr");
    state->f4.reg.apb2lpenr = cm_object_get_child_by_name(obj, "apb2lpenr");
    state->f4.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f4.reg.csr = cm_object_get_child_by_name(obj, "csr");
    state->f4.reg.bdcr = cm_object_get_child_by_name(obj, "bdcr");
    state->f4.reg.sscgr = cm_object_get_child_by_name(obj, "sscgr");

    /* CR bitfields. */
    state->f4.fld.cr.hsion = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsion");
    state->f4.fld.cr.hsirdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsirdy");
    state->f4.fld.cr.hsitrim = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsitrim");
    state->f4.fld.cr.hsical = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsical");
    state->f4.fld.cr.hseon = cm_object_get_child_by_name(state->f4.reg.cr,
            "hseon");
    state->f4.fld.cr.hserdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "hserdy");
    state->f4.fld.cr.hsebyp = cm_object_get_child_by_name(state->f4.reg.cr,
            "hsebyp");
    state->f4.fld.cr.csson = cm_object_get_child_by_name(state->f4.reg.cr,
            "csson");
    state->f4.fld.cr.pllon = cm_object_get_child_by_name(state->f4.reg.cr,
            "pllon");
    state->f4.fld.cr.pllrdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "pllrdy");
    state->f4.fld.cr.plli2son = cm_object_get_child_by_name(state->f4.reg.cr,
            "plli2son");
    state->f4.fld.cr.plli2srdy = cm_object_get_child_by_name(state->f4.reg.cr,
            "plli2srdy");

    /* PLLCFGR bitfields. */
    state->f4.fld.pllcfgr.pllm = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllm");
    state->f4.fld.pllcfgr.plln = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "plln");
    state->f4.fld.pllcfgr.pllp = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllp");
    state->f4.fld.pllcfgr.pllsrc = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllsrc");
    state->f4.fld.pllcfgr.pllq = cm_object_get_child_by_name(
            state->f4.reg.pllcfgr, "pllq");

    /* CFGR bitfields. */
    state->f4.fld.cfgr.sw = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "sw");
    state->f4.fld.cfgr.sws = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "sws");
    state->f4.fld.cfgr.hpre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "hpre");
    state->f4.fld.cfgr.ppre1 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "ppre1");
    state->f4.fld.cfgr.ppre2 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "ppre2");
    state->f4.fld.cfgr.rtcpre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "rtcpre");
    state->f4.fld.cfgr.mco1 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco1");
    state->f4.fld.cfgr.i2ssrc = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "i2ssrc");
    state->f4.fld.cfgr.mco1pre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco1pre");
    state->f4.fld.cfgr.mco2pre = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco2pre");
    state->f4.fld.cfgr.mco2 = cm_object_get_child_by_name(state->f4.reg.cfgr,
            "mco2");

    /* CIR bitfields. */
    state->f4.fld.cir.lsirdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "lsirdyf");
    state->f4.fld.cir.lserdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "lserdyf");
    state->f4.fld.cir.hsirdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "hsirdyf");
    state->f4.fld.cir.hserdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "hserdyf");
    state->f4.fld.cir.pllrdyf = cm_object_get_child_by_name(state->f4.reg.cir,
            "pllrdyf");
    state->f4.fld.cir.plli2srdyf = cm_object_get_child_by_name(
            state->f4.reg.cir, "plli2srdyf");
    state->f4.fld.cir.cssf = cm_object_get_child_by_name(state->f4.reg.cir,
            "cssf");

    /* BDCR bitfields. */
    state->f4.fld.bdcr.lserdy = cm_object_get_child_by_name(state->f4.reg.bdcr,
            "lserdy");

    /* CSR bitfields. */
    state->f4.fld.csr.lsirdy = cm_object_get_child_by_name(state->f4.reg.csr,
            "lsirdy");
    state->f4.fld.csr.pinrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "pinrstf");
    state->f4.fld.csr.porrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "porrstf");
    state->f4.fld.csr.stfrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "stfrstf");
    state->f4.fld.csr.iwdgrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "iwdgrstf");
    state->f4.fld.csr.wwdgrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "wwdgrstf");
    state->f4.fld.csr.lpwrrstf = cm_object_get_child_by_name(state->f4.reg.csr,
            "lpwrrstf");

