ilg-archived/qemu/hw/cortexm/stm32-rcc.c
}

/* ------------------------------------------------------------------------- */

/* STM32F4_23_xxx */

static PeripheralInfo stm32f4_23_xxx_rcc_info =
        {
            .desc = "Reset and clock control (RCC)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc = "Clock control register (RCC_CR)",
                                    .name = "cr",
                                    .offset_bytes = 0x00,
                                    .reset_value = 0x00000083,
                                    .reset_mask = 0xFFFF00FF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "hsion",
                                                            .desc =
                                                                    "Internal high-speed clock enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "hsirdy",
                                                            .desc =
                                                                    "Internal high-speed clock ready flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsitrim",
                                                            .desc =
                                                                    "Internal high-speed clock trimming",
                                                            .first_bit = 3,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "hsical",
                                                            .desc =
                                                                    "Internal high-speed clock calibration",
                                                            .first_bit = 8,
                                                            .width_bits = 8,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hseon",
                                                            .desc =
                                                                    "External clock enable",
                                                            .first_bit = 16, },
                                                        {
                                                            .name = "hserdy",
                                                            .desc =
                                                                    "External high-speed clock ready flag",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsebyp",
                                                            .desc =
                                                                    "External high-speed clock bypass",
                                                            .first_bit = 18, },
                                                        {
                                                            .name = "csson",
                                                            .desc =
                                                                    "Clock security system enable",
                                                            .first_bit = 19, },
                                                        {
                                                            .name = "pllon",
                                                            .desc = "PLL enable",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "pllrdy",
                                                            .desc =
                                                                    "PLL clock ready flag",
                                                            .first_bit = 25,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "plli2son",
                                                            .desc =
                                                                    "PLL I2S enable",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "plli2srdy",
                                                            .desc =
                                                                    "PLL I2S clock ready flag",
                                                            .first_bit = 27,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllsaion",
                                                            .desc =
                                                                    "PLL SAI enable",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "pllsairdy",
                                                            .desc =
                                                                    "PLL SAI clock ready flag",
                                                            .first_bit = 29,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        { }, /**/
                                                    } , /**/},
                                {
                                    .desc =
                                            "RCC PLL configuration register (RCC_PLLCFGR)",
                                    .name = "pllcfgr",
                                    .offset_bytes = 0x04,
                                    .reset_value = 0x24003010,
                                    .readable_bits = 0x0F437FFF,
                                    .writable_bits = 0x0F437FFF,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "pllm",
                                                            .desc =
                                                                    "PLL division factor",
                                                            .first_bit = 0,
                                                            .width_bits = 6, },
                                                        {
                                                            .name = "plln",
                                                            .desc =
                                                                    "PLL multiplication factor",
                                                            .first_bit = 6,
                                                            .width_bits = 9, },
                                                        {
                                                            .name = "pllp",
                                                            .desc =
                                                                    "Main PLL (PLL) division factor",
                                                            .first_bit = 16,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "pllsrc",
                                                            .desc =
                                                                    "Main PLL (PLL) clock source",
                                                            .first_bit = 22, },
                                                        {
                                                            .name = "pllq",
                                                            .desc =
                                                                    "Main PLL (PLL) division factor",
                                                            .first_bit = 24,
                                                            .width_bits = 4, },
                                                        { }, } , },
                                {
                                    .desc =
                                            "RCC clock configuration register (RCC_CFGR)",
                                    .name = "cfgr",
                                    .offset_bytes = 0x08,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "sw",
                                                            .desc =
                                                                    "System clock switch",
                                                            .first_bit = 0,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "sws",
                                                            .desc =
                                                                    "System clock switch status",
                                                            .first_bit = 2,
                                                            .width_bits = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hpre",
                                                            .desc =
                                                                    "AHB prescaler",
                                                            .first_bit = 4,
                                                            .width_bits = 4, },
                                                        {
                                                            .name = "ppre1",
                                                            .desc =
                                                                    "APB Low speed prescaler (APB1)",
                                                            .first_bit = 10,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "ppre2",
                                                            .desc =
                                                                    "APB high speed prescaler (APB2)",
                                                            .first_bit = 13,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "rtcpre",
                                                            .desc =
                                                                    "HSE division factor for RTC clock",
                                                            .first_bit = 16,
                                                            .width_bits = 5, },
                                                        {
                                                            .name = "mco1",
                                                            .desc =
                                                                    "Microcontroller clock output 1",
                                                            .first_bit = 21,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "i2ssrc",
                                                            .desc =
                                                                    "I2S clock selection",
                                                            .first_bit = 23, },
                                                        {
                                                            .name = "mco1pre",
                                                            .desc =
                                                                    "MCO1 prescaller",
                                                            .first_bit = 24,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "mco2pre",
                                                            .desc =
                                                                    "MCO2 prescaller",
                                                            .first_bit = 27,
                                                            .width_bits = 3, },
                                                        {
                                                            .name = "mco2",
                                                            .desc =
                                                                    "Microcontroller clock output 2",
                                                            .first_bit = 30,
                                                            .width_bits = 2, },
                                                        { }, /**/
                                                    } , /**/},
                                {
                                    .desc = "Clock interrupt register (RCC_CIR)",
                                    .name = "cir",
                                    .offset_bytes = 0x0C,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsirdyf",
                                                            .desc =
                                                                    "LSI ready interrupt flag",
                                                            .first_bit = 0,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lserdyf",
                                                            .desc =
                                                                    "LSE ready interrupt flag",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hsirdyf",
                                                            .desc =
                                                                    "HSI ready interrupt flag",
                                                            .first_bit = 2,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "hserdyf",
                                                            .desc =
                                                                    "HSE ready interrupt flag",
                                                            .first_bit = 3,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllrdyf",
                                                            .desc =
                                                                    "PLL ready interrupt flag",
                                                            .first_bit = 4,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "plli2srdyf",
                                                            .desc =
                                                                    "PLL I2S ready interrupt flag",
                                                            .first_bit = 5,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "pllsairdyf",
                                                            .desc =
                                                                    "PLL SAI ready interrupt flag",
                                                            .first_bit = 6,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "cssf",
                                                            .desc =
                                                                    "Clock security system interrupt flag",
                                                            .first_bit = 7,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsirdyie",
                                                            .desc =
                                                                    "LSI ready interrupt enable",
                                                            .first_bit = 8, },
                                                        {
                                                            .name = "lserdyie",
                                                            .desc =
                                                                    "LSE ready interrupt enable",
                                                            .first_bit = 9, },
                                                        {
                                                            .name = "hsirdyie",
                                                            .desc =
                                                                    "HSI ready interrupt enable",
                                                            .first_bit = 10, },
                                                        {
                                                            .name = "hserdyie",
                                                            .desc =
                                                                    "HSE ready interrupt enable",
                                                            .first_bit = 11, },
                                                        {
                                                            .name = "pllrdyie",
                                                            .desc =
                                                                    "PLL ready interrupt enable",
                                                            .first_bit = 12, },
                                                        {
                                                            .name =
                                                                    "plli2srdyie",
                                                            .desc =
                                                                    "PLL I2S ready interrupt enable",
                                                            .first_bit = 13, },
                                                        {
                                                            .name =
                                                                    "pllsairdyie",
                                                            .desc =
                                                                    "PLL SAI ready interrupt enable",
                                                            .first_bit = 14, },
                                                        {
                                                            .name = "lsirdyc",
                                                            .desc =
                                                                    "LSI ready interrupt clear",
                                                            .first_bit = 16,
                                                            .rw_mode =
