ilg-archived/qemu/hw/cortexm/stm32-rcc.c
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "lserdyc",
                                                            .desc =
                                                                    "LSE ready interrupt clear",
                                                            .first_bit = 17,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hsirdyc",
                                                            .desc =
                                                                    "HSI ready interrupt clear",
                                                            .first_bit = 18,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "hserdyc",
                                                            .desc =
                                                                    "HSE ready interrupt clear",
                                                            .first_bit = 19,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pllrdyc",
                                                            .desc =
                                                                    "PLL ready interrupt clear",
                                                            .first_bit = 20,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "plli2srdyc",
                                                            .desc =
                                                                    "PLL I2S ready interrupt clear",
                                                            .first_bit = 21,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "pllsairdyc",
                                                            .desc =
                                                                    "PLL SAI ready interrupt clear",
                                                            .first_bit = 22,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        {
                                                            .name = "cssc",
                                                            .desc =
                                                                    "Clock security system interrupt clear",
                                                            .first_bit = 23,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_WRITE, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral reset register (RCC_AHB1RSTR)",
                                    .name = "ahb1rstr",
                                    .offset_bytes = 0x10,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x22E017FF,
                                    .writable_bits = 0x22E017FF, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral reset register (RCC_AHB2RSTR)",
                                    .name = "ahb2rstr",
                                    .offset_bytes = 0x14,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x000000F1,
                                    .writable_bits = 0x000000F1, },
                                {
                                    .desc =
                                            "RCC AHB3 peripheral reset register (RCC_AHB3RSTR)",
                                    .name = "ahb3rstr",
                                    .offset_bytes = 0x18,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x00000001,
                                    .writable_bits = 0x00000001, },
                                {
                                    .desc =
                                            "RCC APB1 peripheral reset register (RCC_APB1RSTR)",
                                    .name = "apb1rstr",
                                    .offset_bytes = 0x20,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0xF6FEC9FF,
                                    .writable_bits = 0xF6FEC9FF, },
                                {
                                    .desc =
                                            "RCC APB2 peripheral reset register (RCC_APB2RSTR)",
                                    .name = "apb2rstr",
                                    .offset_bytes = 0x24,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x04777933,
                                    .writable_bits = 0x04777933, },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral clock enable register (RCC_AHB1ENR)",
                                    .name = "ahb1enr",
                                    .offset_bytes = 0x30,
                                    .reset_value = 0x00100000,
                                    .readable_bits = 0x7EFC17FF,
                                    .writable_bits = 0x7EFC17FF, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral clock enable register (RCC_AHB2ENR)",
                                    .name = "ahb2enr",
                                    .offset_bytes = 0x34,
                                    .reset_value = 0x00100000,
                                    .readable_bits = 0x000000F1,
                                    .writable_bits = 0x000000F1, },
                                {
                                    .desc =
                                            "RCC AHB3 peripheral clock enable register (RCC_AHB3ENR)",
                                    .name = "ahb3enr",
                                    .offset_bytes = 0x38,
                                    .reset_value = 0x00100000,
                                    .readable_bits = 0x00000001,
                                    .writable_bits = 0x00000001, },
                                {
                                    .desc =
                                            "APB1 peripheral clock enable register (RCC_APB1ENR)",
                                    .name = "apb1enr",
                                    .offset_bytes = 0x40,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0xF6FEC9FF,
                                    .writable_bits = 0xF6FEC9FF, },
                                {
                                    .desc =
                                            "APB2 peripheral clock enable register (RCC_APB2ENR)",
                                    .name = "apb2enr",
                                    .offset_bytes = 0x44,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x04777F33,
                                    .writable_bits = 0x04777F33, },
                                {
                                    .desc =
                                            "RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR)",
                                    .name = "ahb1lpenr",
                                    .offset_bytes = 0x50,
                                    .reset_value = 0x7E6791FF,
                                    .readable_bits = 0x7EEF9EFF,
                                    .writable_bits = 0x7EEF9EFF, },
                                {
                                    .desc =
                                            "RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR)",
                                    .name = "ahb2lpenr",
                                    .offset_bytes = 0x54,
                                    .reset_value = 0x000000F1,
                                    .readable_bits = 0x000000F1,
                                    .writable_bits = 0x000000F1, },
                                {
                                    .desc =
                                            "RCC AHB3 peripheral clock enable in low power mode register (RCC_AHB3LPENR)",
                                    .name = "ahb3lpenr",
                                    .offset_bytes = 0x58,
                                    .reset_value = 0x00000001,
                                    .readable_bits = 0x00000001,
                                    .writable_bits = 0x00000001, },
                                {
                                    .desc =
                                            "RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR)",
                                    .name = "apb1lpenr",
                                    .offset_bytes = 0x60,
                                    .reset_value = 0x36FEC9FF,
                                    .readable_bits = 0xFEFEC9FF,
                                    .writable_bits = 0xFEFEC9FF, },
                                {
                                    .desc =
                                            "RCC APB2 peripheral clock enable in low power mode register (RCC_APB2LPENR)",
                                    .name = "apb2lpenr",
                                    .offset_bytes = 0x64,
                                    .reset_value = 0x00075F33,
                                    .readable_bits = 0x04777F33,
                                    .writable_bits = 0x04777F33, },
                                {
                                    .desc =
                                            "RCC Backup domain control register (RCC_BDCR)",
                                    .name = "bdcr",
                                    .offset_bytes = 0x70,
                                    .reset_value = 0x00000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lseon",
                                                            .desc =
                                                                    "External low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lserdy",
                                                            .desc =
                                                                    "External low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "lsebyp",
                                                            .desc =
                                                                    "External low-speed oscillator bypass",
                                                            .first_bit = 2, },
                                                        {
                                                            .name = "rtcsel",
                                                            .desc =
                                                                    "RTC clock source selection",
                                                            .first_bit = 8,
                                                            .width_bits = 2, },
                                                        {
                                                            .name = "rtcen",
                                                            .desc =
                                                                    "RTC clock enable",
                                                            .first_bit = 15, },
                                                        {
                                                            .name = "bdrst",
                                                            .desc =
                                                                    "Backup domain software reset",
                                                            .first_bit = 16, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc = "Control/status register (RCC_CSR)",
                                    .name = "csr",
                                    .offset_bytes = 0x74,
                                    .reset_value = 0x0E000000,
                                    .bitfields =
                                            (RegisterBitfieldInfo[] ) {
                                                        {
                                                            .name = "lsion",
                                                            .desc =
                                                                    "Internal low-speed oscillator enable",
                                                            .first_bit = 0, },
                                                        {
                                                            .name = "lsirdy",
                                                            .desc =
                                                                    "Internal low-speed oscillator ready",
                                                            .first_bit = 1,
                                                            .rw_mode =
                                                                    REGISTER_RW_MODE_READ, },
                                                        {
                                                            .name = "rmvf",
                                                            .desc =
                                                                    "Remove reset flag",
                                                            .first_bit = 24, },
                                                        {
                                                            .name = "borrstf",
                                                            .desc =
                                                                    "BOR reset flag",
                                                            .first_bit = 25, },
                                                        {
                                                            .name = "pinrstf",
                                                            .desc =
                                                                    "PIN reset flag",
                                                            .first_bit = 26, },
                                                        {
                                                            .name = "porrstf",
                                                            .desc =
                                                                    "POR/PDR reset flag",
                                                            .first_bit = 27, },
                                                        {
                                                            .name = "stfrstf",
                                                            .desc =
                                                                    "Software reset flag",
                                                            .first_bit = 28, },
                                                        {
                                                            .name = "iwdgrstf",
                                                            .desc =
                                                                    "Independent watchdog reset flag",
                                                            .first_bit = 29, },
                                                        {
                                                            .name = "wwdgrstf",
                                                            .desc =
                                                                    "Window watchdog reset flag",
                                                            .first_bit = 30, },
                                                        {
                                                            .name = "lpwrrstf",
                                                            .desc =
                                                                    "Low-power reset flag",
                                                            .first_bit = 31, },
                                                        { }, /**/
                                                    } , /**/
                                },
                                {
                                    .desc =
                                            "RCC spread spectrum clock generation register (RCC_SSCGR)",
                                    .name = "sscgr",
                                    .offset_bytes = 0x80,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0xCEFFFFFF,
                                    .writable_bits = 0xCEFFFFFF, },
                                {
                                    .desc =
                                            "RCC PLLI2S configuration register (RCC_PLLI2SCFGR)",
                                    .name = "plli2scfgr",
                                    .offset_bytes = 0x84,
                                    .reset_value = 0x20003000,
                                    .readable_bits = 0x7F007FC0,
                                    .writable_bits = 0x7F007FC0, },
                                {
                                    .desc =
                                            "RCC PLLSAI configuration register (RCC_PLLI2SCFGR)",
                                    .name = "pllsaicfgr",
                                    .offset_bytes = 0x88,
                                    .reset_value = 0x24003000,
                                    .readable_bits = 0x7F007FC0,
                                    .writable_bits = 0x7F007FC0, },
                                {
                                    .desc =
                                            "RCC Dedicated Clock Configuration Register (RCC_DCKCFGR)",
                                    .name = "plldckcfgr",
                                    .offset_bytes = 0x8C,
                                    .reset_value = 0x00000000,
                                    .readable_bits = 0x01F31F1F,
                                    .writable_bits = 0x01F31F1F, },
                                { }, /**/
                            } , /**/
        };

