ilg-archived/qemu/hw/cortexm/stm32-rcc.c
}

/* ------------------------------------------------------------------------- */

static uint8_t AHBPrescTable[16] = {
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    2,
    3,
    4,
    6,
    7,
    8,
    9 };

extern int system_clock_scale;

/* ------------------------------------------------------------------------- */

static void stm32_rcc_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32RCCState *state = STM32_RCC_STATE(periph);
    stm32_rcc_update_clocks(state);
}

/**
 * Recompute the system clock, after each change in the RCC registers.
 * The code is inspired by CMSIS init sequences.
 */
static void stm32_rcc_update_clocks(STM32RCCState *state)
{
    const STM32Capabilities *capabilities = state->capabilities;

    uint32_t cpu_freq_hz = 0;
    uint32_t pre_scaler;

    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        /* The following code was copied from the CMSIS system_stm32f10x.c  */

        switch (register_bitfield_read_value(state->f1.cfgr.sws)) {
        case 0:
            /* HSI used as system clock. */
            cpu_freq_hz = state->hsi_freq_hz;
            break;

        case 1:
            /* HSE used as system clock. */
            cpu_freq_hz = state->hse_freq_hz;
            break;

        case 2:
            /* PLL used as system clock. */
            if (!capabilities->f1.is_cl) {
                /* Most F1 families, except CL. */

                /* Get PLL clock source and multiplication factor. */
                uint32_t pllmul = register_bitfield_read_value(
                        state->f1.cfgr.pllmul) + 2;
                if (register_bitfield_is_zero(state->f1.cfgr.pllsrc)) {
                    /* HSI oscillator clock divided by 2 selected as PLL
                     * clock entry */
                    cpu_freq_hz = (state->hsi_freq_hz >> 1) * pllmul;
                } else {
                    if (capabilities->f1.is_ldvl || capabilities->f1.is_mdvl
                            || capabilities->f1.is_hdvl) {
                        /* The value line families use the CFGR2. */
                        uint32_t prediv1factor = 0;
                        prediv1factor = register_bitfield_read_value(
                                state->f1.cfgr2.prediv1) + 1;
                        /*
                         * HSE oscillator clock selected as PREDIV1
                         * clock entry.
                         */
                        cpu_freq_hz = (state->hse_freq_hz / prediv1factor)
                                * pllmul;
                    } else {
                        /* HSE selected as PLL clock entry. */
                        if (!register_bitfield_is_zero(
                                state->f1.cfgr.pllxtpre)) {
                            /* HSE oscillator clock divided by 2. */
                            cpu_freq_hz = (state->hse_freq_hz >> 1) * pllmul;
                        } else {
                            cpu_freq_hz = state->hse_freq_hz * pllmul;
                        }
                    }
                }
            } else {
                /* The F1 CL family. */
                uint32_t pllmul = register_bitfield_read_value(
                        state->f1.cfgr.pllmul);

                if (pllmul != 13) {
                    pllmul += 2;
                } else {
                    /* PLL multiplication factor = PLL input clock * 6.5 */
                    pllmul = 13 / 2;
                }

                if (register_bitfield_is_zero(state->f1.cfgr.pllsrc)) {
                    /*
                     * HSI oscillator clock divided by 2 selected as PLL
                     * clock entry.
                     */
                    cpu_freq_hz = (state->hsi_freq_hz >> 1) * pllmul;
                } else {
                    /*
                     * PREDIV1 selected as PLL clock entry.
                     * Get PREDIV1 clock source and division factor.
                     */
                    uint32_t prediv1factor = register_bitfield_read_value(
                            state->f1.cfgr2.prediv1) + 1;

                    if (register_bitfield_is_zero(state->f1.cfgr2.prediv1src)) {
                        /*
                         * HSE oscillator clock selected as PREDIV1
                         * clock entry.
                         */
                        cpu_freq_hz = (state->hse_freq_hz / prediv1factor)
                                * pllmul;
                    } else {
                        /*
                         * PLL2 clock selected as PREDIV1 clock entry.
                         * Get PREDIV2 division factor and PLL2
                         * multiplication factor.
                         */
                        uint32_t prediv2factor = register_bitfield_read_value(
                                state->f1.cfgr2.prediv2) + 1;
                        uint32_t pll2mull = register_bitfield_read_value(
                                state->f1.cfgr2.pll2mul) + 2;
                        cpu_freq_hz = (((state->hse_freq_hz / prediv2factor)
                                * pll2mull) / prediv1factor) * pllmul;
                    }
                }
            }
            break;

        default:
            cpu_freq_hz = state->hsi_freq_hz;
            break;
        }

        /*
         * Compute HCLK clock frequency. Get HCLK pre-scaler.
         */
        pre_scaler = AHBPrescTable[register_bitfield_read_value(
                state->f1.cfgr.hpre)];
        /* HCLK clock frequency */
        cpu_freq_hz >>= pre_scaler;

        break;

    case STM32_FAMILY_F4:

        /* The following code was copied from the CMSIS system_stm32f4xx.c  */

        /* Get SYSCLK source */
        switch (register_bitfield_read_value(state->f4.fld.cfgr.sws)) {
        case 0:
            /* HSI used as system clock source */
            cpu_freq_hz = state->hsi_freq_hz;
            break;

        case 1:
            /* HSE used as system clock source */
            cpu_freq_hz = state->hse_freq_hz;
            break;

