ilg-archived/qemu/hw/cortexm/stm32-rcc.c
        case 2:

            /* PLL used as system clock source */
        {
            uint32_t pllm;
            uint32_t pllvco = 0;
            /*
             * PLL_VCO = (HSE_VALUE or HSI_VALUE / PLL_M) * PLL_N
             * SYSCLK = PLL_VCO / PLL_P
             */
            pllm = register_bitfield_read_value(state->f4.fld.pllcfgr.pllm);
            if (!register_bitfield_is_zero(state->f4.fld.pllcfgr.pllsrc)) {
                /* HSE used as PLL clock source */
                pllvco = (state->hse_freq_hz / pllm)
                        * register_bitfield_read_value(
                                state->f4.fld.pllcfgr.plln);
            } else {
                /* HSI used as PLL clock source */
                pllvco = (state->hsi_freq_hz / pllm)
                        * register_bitfield_read_value(
                                state->f4.fld.pllcfgr.plln);
            }

            uint32_t pllp;
            pllp = ((register_bitfield_read_value(state->f4.fld.pllcfgr.pllp))
                    + 1) * 2;
            cpu_freq_hz = pllvco / pllp;
        }
            break;
        default:
            cpu_freq_hz = state->hsi_freq_hz;
            break;
        }
        /*
         * Compute HCLK clock frequency. Get HCLK pre-scaler.
         */
        pre_scaler = AHBPrescTable[register_bitfield_read_value(
                state->f4.fld.cfgr.hpre)];
        /* HCLK frequency */
        cpu_freq_hz >>= pre_scaler;

        break;

    default:
        break;
    }

    if (cpu_freq_hz == 0) {
        cpu_freq_hz = state->hsi_freq_hz; /* Should be non-zero. */
    }
    state->cpu_freq_hz = cpu_freq_hz;

    system_clock_scale = NANOSECONDS_PER_SECOND / cpu_freq_hz;
    if (system_clock_scale == 0) {
        system_clock_scale = 1;
    }
    qemu_log_mask(LOG_TRACE, "%s() %d, system_clock_scale=%d\n", __FUNCTION__,
            cpu_freq_hz, system_clock_scale);
}

/* ------------------------------------------------------------------------- */

static void stm32_rcc_instance_init_callback(Object *obj)
{
    qemu_log_function_name();

    STM32RCCState *state = STM32_RCC_STATE(obj);

    cm_object_property_add_uint32(obj, "hse-freq-hz", &state->hse_freq_hz);
    state->hse_freq_hz = 0; /* No HSE */

    cm_object_property_add_uint32(obj, "lse-freq-hz", &state->lse_freq_hz);
    state->lse_freq_hz = 0; /* No LSE */

    cm_object_property_add_uint32(obj, "hsi-freq-hz", &state->hsi_freq_hz);
    state->hsi_freq_hz = 0;

    cm_object_property_add_uint32(obj, "lsi-freq-hz", &state->lsi_freq_hz);
    state->lsi_freq_hz = 0;
}

static void stm32_rcc_realize_callback(DeviceState *dev, Error **errp)
{
    qemu_log_function_name();

    /*
     * Parent realize() is called after setting properties and creating
     * registers.
     */
    STM32RCCState *state = STM32_RCC_STATE(dev);

    const STM32Capabilities *capabilities = state->capabilities;
    assert(capabilities != NULL);

    Object *obj = OBJECT(dev);

    /* Must be defined before creating registers. */
    cm_object_property_set_int(obj, 4, "register-size-bytes");

    /* TODO: get it from MCU */
    cm_object_property_set_bool(obj, true, "is-little-endian");

    uint32_t size;
    hwaddr addr;
    switch (capabilities->family) {
    case STM32_FAMILY_F1:
        addr = 0x40021000;
        size = 0x400;
        break;

    case STM32_FAMILY_F4:
        addr = 0x40023800;
        size = 0x400;
        break;

    default:
        /*
         * This will trigger an assertion to fail when creating the
         * memory region in the parent class.
         */
        size = 0;
        addr = 0;
        break;
    }

    cm_object_property_set_int(obj, addr, "mmio-address");
    cm_object_property_set_int(obj, size, "mmio-size-bytes");

    assert(capabilities->hsi_freq_hz);
    assert(capabilities->lsi_freq_hz);

    /* Set defaults, need to be non-zero */
    if (state->hsi_freq_hz == 0) {
        state->hsi_freq_hz = capabilities->hsi_freq_hz;
    }

    if (state->lsi_freq_hz == 0) {
        state->lsi_freq_hz = capabilities->lsi_freq_hz;
    }

    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        if (!capabilities->f1.is_cl) {

            stm32f1_rcc_create_objects(obj);

            /* Callbacks. */
            peripheral_register_set_post_write(state->f1.reg.cr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.cfgr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.bdcr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.csr,
                    &stm32_rcc_post_write_callback);

            /* Auto bits. */
            cm_object_property_set_str(state->f1.cr.hsirdy, "hsion", "follows");

            if (state->hse_freq_hz) {
                cm_object_property_set_str(state->f1.cr.hserdy, "hseon",
                        "follows");
            }
            cm_object_property_set_str(state->f1.cr.pllrdy, "pllon", "follows");

            cm_object_property_set_str(state->f1.cfgr.sws, "sw", "follows");

            cm_object_property_set_str(state->f1.cir.lsirdyf, "lsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.lserdyf, "lserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.hsirdyf, "hsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.hserdyf, "hserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.pllrdyf, "pllrdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.cssf, "cssc",
                    "cleared-by");

            cm_object_property_set_str(state->f1.bdcr.lserdy, "lseon",
                    "follows");

            cm_object_property_set_str(state->f1.csr.lsirdy, "lsion",
                    "follows");
            cm_object_property_set_str(state->f1.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.porrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.stfrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.iwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.wwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.lrwrrstf, "rmvf",
                    "cleared-by");

        } else {

            stm32f1cl_rcc_create_objects(obj);

            /* Add callbacks. */
            peripheral_register_set_post_write(state->f1.reg.cr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.cfgr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.bdcr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.csr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f1.reg.cfgr2,
                    &stm32_rcc_post_write_callback);

            /* Auto bits. */
            cm_object_property_set_str(state->f1.cr.hsirdy, "hsion", "follows");
            if (state->hse_freq_hz) {
                cm_object_property_set_str(state->f1.cr.hserdy, "hseon",
                        "follows");
            }
            cm_object_property_set_str(state->f1.cr.pllrdy, "pllon", "follows");
            cm_object_property_set_str(state->f1.cr.pll2rdy, "pll2on",
                    "follows");
            cm_object_property_set_str(state->f1.cr.pll3rdy, "pll3on",
                    "follows");

            cm_object_property_set_str(state->f1.cfgr.sws, "sw", "follows");

