ilg-archived/qemu/hw/cortexm/stm32-rcc.c
            cm_object_property_set_str(state->f1.cir.lsirdyf, "lsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.lserdyf, "lserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.hsirdyf, "hsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.hserdyf, "hserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.pllrdyf, "pllrdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.pll2rdyf, "pll2rdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.pll3rdyf, "pll3rdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f1.cir.cssf, "cssc",
                    "cleared-by");

            cm_object_property_set_str(state->f1.bdcr.lserdy, "lseon",
                    "follows");

            cm_object_property_set_str(state->f1.csr.lsirdy, "lsion",
                    "follows");
            cm_object_property_set_str(state->f1.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.porrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.stfrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.iwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.wwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f1.csr.lrwrrstf, "rmvf",
                    "cleared-by");
        }
        break;

    case STM32_FAMILY_F4:

        if (capabilities->f4.is_01_57_xx) {

            stm32f4_01_57_xx_rcc_create_objects(obj);

            /* Add callbacks. */
            peripheral_register_set_post_write(state->f4.reg.pllcfgr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f4.reg.cfgr,
                    &stm32_rcc_post_write_callback);

            /* Auto bits. */
            cm_object_property_set_str(state->f4.fld.cr.hsirdy, "hsion",
                    "follows");
            if (state->hse_freq_hz) {
                cm_object_property_set_str(state->f4.fld.cr.hserdy, "hseon",
                        "follows");
            }
            cm_object_property_set_str(state->f4.fld.cr.pllrdy, "pllon",
                    "follows");
            cm_object_property_set_str(state->f4.fld.cr.plli2srdy, "plli2son",
                    "follows");

            cm_object_property_set_str(state->f4.fld.cfgr.sws, "sw", "follows");

            cm_object_property_set_str(state->f4.fld.cir.lsirdyf, "lsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.lserdyf, "lserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hsirdyf, "hsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hserdyf, "hserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.pllrdyf, "pllrdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.plli2srdyf,
                    "plli2srdyc", "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.cssf, "cssc",
                    "cleared-by");

            cm_object_property_set_str(state->f4.fld.bdcr.lserdy, "lseon",
                    "follows");

            cm_object_property_set_str(state->f4.fld.csr.lsirdy, "lsion",
                    "follows");
            cm_object_property_set_str(state->f4.fld.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.porrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.stfrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.iwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.wwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.lpwrrstf, "rmvf",
                    "cleared-by");

        } else if (capabilities->f4.is11xx) {

            stm32f411xx_rcc_create_objects(obj);

            /* Add callbacks. */
            peripheral_register_set_post_write(state->f4.reg.pllcfgr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f4.reg.cfgr,
                    &stm32_rcc_post_write_callback);

            /* Auto bits. */
            cm_object_property_set_str(state->f4.fld.cr.hsirdy, "hsion",
                    "follows");
            if (state->hse_freq_hz) {
                cm_object_property_set_str(state->f4.fld.cr.hserdy, "hseon",
                        "follows");
            }
            cm_object_property_set_str(state->f4.fld.cr.pllrdy, "pllon",
                    "follows");
            cm_object_property_set_str(state->f4.fld.cr.plli2srdy, "plli2son",
                    "follows");

            cm_object_property_set_str(state->f4.fld.cfgr.sws, "sw", "follows");

            cm_object_property_set_str(state->f4.fld.cir.lsirdyf, "lsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.lserdyf, "lserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hsirdyf, "hsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hserdyf, "hserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.pllrdyf, "pllrdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.plli2srdyf,
                    "plli2srdyc", "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.cssf, "cssc",
                    "cleared-by");

            cm_object_property_set_str(state->f4.fld.bdcr.lserdy, "lseon",
                    "follows");

            cm_object_property_set_str(state->f4.fld.csr.lsirdy, "lsion",
                    "follows");
            cm_object_property_set_str(state->f4.fld.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.porrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.stfrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.iwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.wwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.lpwrrstf, "rmvf",
                    "cleared-by");

        } else if (capabilities->f4.is_23_xxx) {

            stm32f4_23_xxx_rcc_create_objects(obj);

            /* Add callbacks. */
            peripheral_register_set_post_write(state->f4.reg.pllcfgr,
                    &stm32_rcc_post_write_callback);
            peripheral_register_set_post_write(state->f4.reg.cfgr,
                    &stm32_rcc_post_write_callback);

            /* Auto bits. */
            cm_object_property_set_str(state->f4.fld.cr.hsirdy, "hsion",
                    "follows");
            if (state->hse_freq_hz) {
                cm_object_property_set_str(state->f4.fld.cr.hserdy, "hseon",
                        "follows");
            }
            cm_object_property_set_str(state->f4.fld.cr.pllrdy, "pllon",
                    "follows");
            cm_object_property_set_str(state->f4.fld.cr.plli2srdy, "plli2son",
                    "follows");

