ilg-archived/qemu/hw/cortexm/stm32-rcc.c
            cm_object_property_set_str(state->f4.fld.cfgr.sws, "sw", "follows");

            cm_object_property_set_str(state->f4.fld.cir.lsirdyf, "lsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.lserdyf, "lserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hsirdyf, "hsirdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.hserdyf, "hserdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.pllrdyf, "pllrdyc",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.plli2srdyf,
                    "plli2srdyc", "cleared-by");
            cm_object_property_set_str(state->f4.fld.cir.cssf, "cssc",
                    "cleared-by");

            cm_object_property_set_str(state->f4.fld.bdcr.lserdy, "lseon",
                    "follows");

            cm_object_property_set_str(state->f4.fld.csr.lsirdy, "lsion",
                    "follows");

            cm_object_property_set_str(state->f4.fld.csr.borrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.pinrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.porrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.stfrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.iwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.wwdgrstf, "rmvf",
                    "cleared-by");
            cm_object_property_set_str(state->f4.fld.csr.lpwrrstf, "rmvf",
                    "cleared-by");
        }

        break;

    default:
        break;
    }

    /* Call parent realize(). */
    if (!cm_device_parent_realize(dev, errp, TYPE_STM32_RCC)) {
        return;
    }
}

static void stm32_rcc_reset_callback(DeviceState *dev)
{
    qemu_log_function_name();

    /* Call parent reset(). */
    cm_device_parent_reset(dev, TYPE_STM32_RCC);

    STM32RCCState *state = STM32_RCC_STATE(dev);

    stm32_rcc_update_clocks(state);
}

static Property stm32_rcc_properties[] = {
        DEFINE_PROP_NON_VOID_PTR("capabilities", STM32RCCState,
                capabilities, const STM32Capabilities *),
    DEFINE_PROP_END_OF_LIST(), };

static void stm32_rcc_class_init_callback(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    dc->reset = stm32_rcc_reset_callback;
    dc->realize = stm32_rcc_realize_callback;
    dc->props = stm32_rcc_properties;
}

static const TypeInfo stm32_rcc_type_info = {
    .name = TYPE_STM32_RCC,
    .parent = TYPE_STM32_RCC_PARENT,
    .instance_init = stm32_rcc_instance_init_callback,
    .instance_size = sizeof(STM32RCCState),
    .class_init = stm32_rcc_class_init_callback,
    .class_size = sizeof(STM32RCCState) /**/
};

static void stm32_rcc_register_types(void)
{
    type_register_static(&stm32_rcc_type_info);
}

type_init(stm32_rcc_register_types);

/* ------------------------------------------------------------------------- */
